{
  "backend/main.mo": "Initializes access control state and mixes in authorization behavior into the backend actor.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles and behaviors of various frontend files.",
  "frontend/docs/production-promotion.md": "Runbook describing steps for promoting a draft frontend build to production.",
  "frontend/docs/smoke-test-live.md": "Manual smoke test checklist for validating the live production environment.",
  "frontend/index.css": "Tailwind base stylesheet defining color variables and themes for light and dark modes.",
  "frontend/index.html": "HTML entry point that loads the React application into the root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, error boundary wrapper, and main application structure.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and renders a fallback UI with reset handling.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing page structure and footer displaying version and branding.",
  "frontend/src/config/appConfig.ts": "Stores owner WhatsApp number and a helper validating that it is properly configured.",
  "frontend/src/config/frontendVersion.ts": "Defines the static frontend version string for deployment verification.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor, initializing access control and refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, wrapping AuthClient and exposing identity state and login/logout functions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin checks, customer CRUD actions, and loan retrieval using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines custom CSS variables for light and dark theme styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/admin/AddCustomerPage.tsx": "Implements an admin form to create new customers with validation, permission checks, and mutation handling.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Provides the admin layout with session checks, identity validation, admin permission gating, and sign‑out flow.",
  "frontend/src/pages/admin/AdminSignInPage.tsx": "Admin sign‑in form that validates email, triggers Internet Identity login, and creates an admin session before navigating to the admin dashboard.",
  "frontend/src/pages/admin/LoansPage.tsx": "Admin interface listing all loans with actions to record EMI payments or close loans, each triggering WhatsApp messages and backend mutations.",
  "frontend/src/pages/customer/CustomerHomePage.tsx": "Customer portal home page showing session info, a request submission entry point, and a sign‑out action.",
  "frontend/src/pages/customer/CustomerRequestPage.tsx": "Customer form to submit finance requests, validates input, then opens WhatsApp with a pre-filled message and shows a success screen.",
  "frontend/src/pages/customer/CustomerSignInPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with navigation to the customer portal.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 error page with options to go back or return home.",
  "frontend/src/state/session.ts": "Manages admin and customer session state using sessionStorage, including email storage and authorization helpers.",
  "frontend/src/types/loan.ts": "Local TypeScript definitions for loans, EMIs, and customer data matching backend structures.",
  "frontend/src/utils/email.ts": "Utility functions for normalizing emails and checking if an admin email matches the allowed address.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/src/utils/whatsapp.ts": "Utilities for formatting WhatsApp messages and generating links for customer requests, EMI updates, and loan closures.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, content scanning, extended colors, animations, and custom typography and container plugins.",
  "project_state.json": "JSON describing project state, feature requests, and configuration metadata for a fix-oriented workflow."
}