{
  "backend/main.mo": "Main backend actor that initializes access control state and includes MixinAuthorization for authorization functionality.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: removal of Aadhar and PAN input fields from customer request form and updating WhatsApp message template to exclude those fields.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including components, pages, utilities, and configuration files for the Nehitha Thandal Management application.",
  "frontend/docs/production-promotion.md": "Runbook documenting the steps and prerequisites for promoting a draft build (including Draft Version 14) to live production environment.",
  "frontend/docs/smoke-test-live.md": "Manual smoke test procedure for production environment covering landing page, navigation, error handling, and version verification (Draft Version 14).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color system, including sidebar and chart color definitions.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'Nehitha Thandal Management'.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with routes for landing, admin (sign-in, dashboard, add customer, loans), and customer (home, request) pages, wrapped in AppErrorBoundary.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches runtime errors and displays a fallback UI with error details and a button to return home.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper component providing consistent container structure with footer displaying branding, caffeine.ai attribution, and frontend version label.",
  "frontend/src/config/appConfig.ts": "Application configuration exporting owner WhatsApp number (+917013568898) in E.164 format with validation helper function.",
  "frontend/src/config/frontendVersion.ts": "Exports FRONTEND_VERSION constant set to 'Draft Version 14' for deployment verification.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages backend actor instances with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, providing login/logout functionality, identity state management, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API operations including admin permission checks, customer CRUD operations, and loan management (fetch all loans, fetch by customer, close loan) with error handling and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm teal/emerald color palette for light and dark themes, including sidebar, chart, and UI component colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/admin/AddCustomerPage.tsx": "Admin page for adding new customers with form validation, admin permission checks, and a table displaying all existing customers with their details.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Protected admin layout component that verifies admin session, Internet Identity authentication, and backend admin permissions before rendering admin routes with navigation sidebar.",
  "frontend/src/pages/admin/AdminSignInPage.tsx": "Admin sign-in page that validates authorized admin emails, integrates Internet Identity authentication, and manages session state with navigation to the admin dashboard upon successful authentication.",
  "frontend/src/pages/admin/LoansPage.tsx": "Admin page for managing loans, displaying all loans with customer details, and providing actions to close loans or record EMI payments with WhatsApp notifications sent to customers.",
  "frontend/src/pages/customer/CustomerHomePage.tsx": "Customer portal home page that displays a welcome message and provides navigation to submit finance requests, with session validation and sign-out functionality.",
  "frontend/src/pages/customer/CustomerRequestPage.tsx": "Customer request form page that collects loan application details (name, mobile, employment, loan reason) and submits them via WhatsApp to the owner with validation and success confirmation.",
  "frontend/src/pages/customer/CustomerSignInPage.tsx": "Empty file placeholder for customer sign-in page implementation.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component displaying the app title and a customer portal access card that navigates to the customer request page.",
  "frontend/src/pages/NotFoundPage.tsx": "404 error page with navigation options to go back or return home, wrapped in AppShell layout.",
  "frontend/src/state/session.ts": "Session management utilities for both admin and customer sessions using sessionStorage, including email normalization, authorization checks, and session lifecycle functions.",
  "frontend/src/types/loan.ts": "TypeScript type definitions for loan management including Loan, Customer, EMI, and LoanStatus types that mirror backend structures.",
  "frontend/src/utils/email.ts": "Email validation and normalization utilities that check if an email matches the authorized admin email (peramharkrishna@gmail.com).",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that handle both query strings and hash-based routing, with sessionStorage persistence for maintaining state across navigation.",
  "frontend/src/utils/whatsapp.ts": "WhatsApp integration utilities that format and build WhatsApp links for customer requests, loan closures, and EMI payment confirmations with proper message templates.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom colors for UI components (sidebar, card, chart, etc.), border radius variables, custom fonts (Inter), and accordion animations.",
  "project_state.json": "Project state tracking file documenting completed features to remove Aadhar and PAN number input fields from a customer request form and update the WhatsApp message template accordingly."
}