{
  "backend/main.mo": "Motoko canister implementing customer, user profiles, loans, and request management with access‑controlled CRUD operations.",
  "feature_evidence.json": "Feature evidence metadata describing a landing‑page UI change and its related files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files covering styles, routing, utilities, pages, and components.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and global background/foreground rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with routes for landing, admin, customers, and requests, wrapped in an error boundary.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary displaying a fallback UI with reset‑to‑home behavior for uncaught errors.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing page container structure and a footer with branding and caffeine.ai attribution.",
  "frontend/src/config/appConfig.ts": "Defines the owner WhatsApp number and a helper to validate its configuration.",
  "frontend/src/hooks/useActor.ts": "Creates and caches authenticated or anonymous backend actors using Internet Identity and initializes access control.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin checks and CRUD operations on customers and loans via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration defining light/dark theme variables and global styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AddCustomerPage.tsx": "Admin page for creating new customers with form validation, permission checks, and customer list fetching.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Admin layout handling session validation, Internet Identity checks, admin permission gating, and navigation shell.",
  "frontend/src/pages/admin/AdminSignInPage.tsx": "Admin sign-in page handling email validation, Internet Identity login, session creation, and navigation.",
  "frontend/src/pages/admin/LoansPage.tsx": "Admin loans dashboard displaying all loans with actions to close loans or record EMI payments using WhatsApp and backend mutations.",
  "frontend/src/pages/customer/CustomerHomePage.tsx": "Customer home page showing a welcome header and a button to create new finance requests, with session checks and sign-out.",
  "frontend/src/pages/customer/CustomerRequestPage.tsx": "Customer request form that validates input, generates a WhatsApp message, and shows a success screen after submission.",
  "frontend/src/pages/customer/CustomerSignInPage.tsx": "Simple customer sign-in page that validates email, stores it in session, and redirects to the customer portal.",
  "frontend/src/pages/LandingPage.tsx": "Landing page UI offering navigation to the customer portal.",
  "frontend/src/pages/NotFoundPage.tsx": "404 page with navigation options to go back or return home.",
  "frontend/src/state/session.ts": "Session utilities for storing, retrieving, and clearing admin and customer emails using sessionStorage.",
  "frontend/src/utils/email.ts": "Email utilities for normalizing emails and validating admin authorization against a fixed allowed address.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/src/utils/whatsapp.ts": "Utility functions for formatting WhatsApp messages and generating WhatsApp links for admins and customers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and plugin support.",
  "project_state.json": "Metadata describing project state, existing features, and pending feature requests."
}