{
  "backend/main.mo": "Motoko canister managing customers, user profiles, and customer requests with admin and user authorization via AccessControl.",
  "feature_evidence.json": "Feature evidence report linking a landing-page navigation change to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of numerous frontend files across styling, config, routing, utilities, and pages.",
  "frontend/index.css": "Root CSS defining OKLCH color variables and light/dark mode tokens using Tailwind layers.",
  "frontend/index.html": "Base HTML file loading the React application entrypoint into a root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing, admin, and customer flows and provides the router to the app.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing container structure and a footer with caffeine.ai attribution.",
  "frontend/src/config/appConfig.ts": "Holds WhatsApp number configuration and a small validator for ensuring proper format.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, reinitializing on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, logout, and identity persistence logic.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for admin checks, fetching customers, and adding customers with normalized error handling.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light and dark theme CSS variables for colors and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AddCustomerPage.tsx": "Provides a form for admins to add customers with validation, permission checks, and customer list fetching.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Defines the admin area layout with session checks, Internet Identity validation, and access control before rendering nested routes.",
  "frontend/src/pages/admin/AdminSignInPage.tsx": "Handles admin sign‑in using email verification and Internet Identity authentication, creating a session on success.",
  "frontend/src/pages/customer/CustomerHomePage.tsx": "Displays the customer portal home with session validation and a card to create new finance requests.",
  "frontend/src/pages/customer/CustomerRequestPage.tsx": "Customer form page that validates input, checks WhatsApp config, and opens a prefilled WhatsApp message before showing an acknowledgment screen.",
  "frontend/src/pages/customer/CustomerSignInPage.tsx": "Simple customer sign‑in page that validates an email and stores it in session before navigating to the customer portal.",
  "frontend/src/pages/LandingPage.tsx": "Renders the landing page with links to the admin portal and customer portal.",
  "frontend/src/state/session.ts": "Session utilities for storing and retrieving admin and customer emails using sessionStorage.",
  "frontend/src/utils/email.ts": "Email utilities for normalizing emails and verifying allowed admin email.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/whatsapp.ts": "Builds a formatted WhatsApp message and constructs a wa.me link using the configured owner number.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, layout, animations, and theme utilities.",
  "project_state.json": "Project metadata describing state, issues, and requirements for fixing external admin portal navigation."
}